
# 전필_87 = {"컴프밍1=3", "컴터그래픽기초=3","일러스트=3", "컴프밍2=3",
#       "웹프밍=3","이산구조=3","객체지향=3","자료구조=3", 
#       "java=3","영편실무=3","unix=3","컴트워크=3",
#       "DB이론=3","영편실무=3","3d그래픽=3","운영체제=3",
#       "디지털애니=3","멀티미디어=3", "모바일=3","시스템보안=3",
#       "시스템프밍=3","인공지능이론=3","jsp=3", "sw공학=3",
#       "빅데이터=3", "컴퓨터비전=3", "고급ai=3","컴퓨터구조=3",
#       "프로젝트실무=3"}


# 전선_0 = {"Lab5","Lab6","Lab7"}

# 교필_32 = {"영어1=2", "발토=2","it개론=3","영어2=2", "생성1=1","tlc4","tlc5","tlc6","tlc7"}

# 교선_15 = {"국제개발=3","사물인터넷=3","파이썬=3","R데이터=3","디자인=3"}

# 채플 = {"채플3","채플4","채플","채플6","채플7"}

result = 87 + 32 + 15
print(result)
